<template>
	<view  class="indexBody" :style="'min-height:'+swiperHeight+'px'" >
		<view class="indexFixed" >
			<view class="liuhaiclass" :style="'height:'+liuhaiHeight+'px'"></view>
		<view class="index_top">隐私政策
			<view class="index_search">
				 <img class="cancel_img" style="margin-top: 5px;width: 0.7rem;"
				  mode="widthFix"   @click='onReturn'
				 src="https://admin.shitutu.com/public/douyinimg/back.png" />
			</view>
		</view>
	</view>
	<view style="height:5rem;width: 100%;"></view>
		<view class="index_c" style="margin-top: 0;">
			
			<view class="about_text" style="margin-top: 0;">
				软铁 声明
				
				    一、【作品上传】由于 软铁网上的作品均由网络用户自行上载，故软铁网无法事先了解作品是否存在侵权等情节，但为切实维护权利人的合法权益，软铁网依据《中华人民共和国侵权责任法》、《中国人民共和国著作权法》、《信息网络传播权保护条例》等法律法规及相关规章制度的规定，采取如下知识产权保护措施：
				    1、 软铁网向软铁网用户传达版权保护理念，提示用户不得上传和传播侵权作品。同时，软铁网对上载作品进行严格审查，向网络用户公示软铁网的基本审查标准，提示用户严格遵守法律法规及尊重他人合法权益。
				    2、 软铁网对于有理由确信存在明显侵权、违法、违反公共利益等情形的作品时，有权不事先通知并随时删除该等侵权作品。对于上传、传播该等侵权作品的网络用户，软铁网将依照《软铁规则》、《软铁网奖惩制度》等规定对其进行处罚。
				    3、 软铁网尊重作品版权，支持权利人（包括版权人、肖像权人等）将侵权情况告知软铁网，共同合作净化网络空间，减少侵权行为的发生。软铁网将在接到符合要求的权利通知后，及时删除涉嫌侵权的作品和相关内容。
				    4、 软铁网动员网络用户对软铁网上的作品进行全面监督，软铁网会在第一时间对举报进行核实，及时清理侵权作品，并视情况对举报人进行奖励。
				    5、网络用户购买下载 软铁网上的作品，应在作品的授权许可范围内使用。同时，作品购买者应遵守著作权法及其他相关法律的规定，不得侵犯本网站及权利人的合法权利。
				    6、 软铁网保留追究任何第三方侵权使用本网站作品的权利。如果您侵犯了本网站作品的著作权，您将被要求按著作权侵权惩罚性赔偿标准或最高达50万元人民币的法定赔偿标准承担赔偿责任。
				    二、【作品审查】 软铁网根据法律法规、规章制度、相关政策及软铁网的规定，对原创会员上传至软铁网的原创作品及其他信息进行审查。对经初步审查合格的作品，将予以审查通过，允许在软铁网上出售。对于软铁网进行的作品审查，网络用户需知悉并理解：
				    1、 软铁网不是知识产权专业机构，只是为用户提供交易平台的网络服务提供者。软铁网不具备审查、判断原创作品是否侵权的能力，也不具备对用户所发布信息的合法性、真实性及其品质，以及用户履行交易的能力等进行审查的能力。但是，为维护原创作者和权利人的合法权益，软铁网还是竭尽所能，依据本身对法律法规的理解，对原创作品进行初步审查。
				    2、 软铁网对原创作品的审查，不能视为软铁网对原创作品版权注意义务的提高。软铁网予以审查通过并进行网上销售的原创作品，也不等于软铁网对该作品不侵权作保证。用户使用软铁网网络服务发布作品及进行其它相关行为所存在的风险与后果，由其自己承担，软铁网对用户不承担任何责任。
				    三、【网站知识产权】 软铁网的任何相关软件、程序、内容，包括但不限于作品、图片、档案、资料、网站构架、网站版面的安排、网页设计、经由 软铁网或广告商向用户呈现的广告或资讯的知识产权均属软铁网所有，“ 软铁”、“shitutu”及相关图形是 软铁网的注册商标，图形已登记版权。未经软铁网许可，任何人不得复制或模仿软铁网，也不得在非软铁网所属服务器上建立镜像。 软铁网的知识产权受法律保护，未经软铁网书面许可，任何单位或个人不得以任何理由和方式使用。凡侵犯软铁网知识产权的，软铁网必依法追究其法律责任。
				    四、【网页广告】 软铁网上的所有页面广告均来自合作单位的自动推送，由合作单位和广告初始单位负责。软铁网对所有页面广告无法事先审查，对其中的非法、虚假内容不具备监控能力，不承担其带来的法律责任。但是，软铁网依然会尽量监督网站上的广告，在接到相关举报后，将立即采取措施屏蔽非法、虚假广告。在此，软铁网也提醒网络用户，在浏览广告时，应理性对待，不轻信广告内容。一旦发现广告存在虚假、违法等情况，第一时间通知软铁网进行屏蔽。
				    五、【用户言论】 软铁网用户所发言论仅代表其个人，不代表软铁网观点。用户在软铁网发表言论的，视为其已经知道并理解这一声明。
				

			</view>
			
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				swiperHeight:500,
				pic_url:'https://admin.shitutu.com/public/douyinimg/mycarda.png',
				liuhaiHeight:3
			}
		},
		onShow:function(){
		    //获取全局设置的变量
		    this.memberData = this.$member.memberObj;
			this.liuhaiHeight = this.memberData.statusBarHeight + 10
		},
		onLoad() {
			uni.getSystemInfo({
			    success:  (res) => {    
			        this.swiperHeight = res.windowHeight 
			    }
			});
		},
		methods:{
			onReturn(){
				uni.navigateBack({
				    delta: 1
				});
			},
		},
		created() {
			
		}
	
	}
</script>

<style>
</style>
