<template>
	<view  class="indexBody" :style="'min-height:'+swiperHeight+'px'" >
		<view class="indexFixed" >
			<view class="liuhaiclass" :style="'height:'+liuhaiHeight+'px'"></view>
		<view class="index_top">用户协议
			<view class="index_search">
				 <img class="cancel_img" style="margin-top: 5px;width: 0.7rem;"
				  mode="widthFix"   @click='onReturn'
				 src="https://admin.shitutu.com/public/douyinimg/back.png" />
			</view>
		</view>
		</view>
		<view style="height:5rem;width: 100%;"></view>
		<view class="index_c" style="margin-top: 0;">
		
			<view class="about_text" style="margin-top: 0;">
				软铁网服务协议
				
				（本协议适用所有在软铁网注册的用户）
				
				特别提示
				    本协议由您与杭州汀之兰文化有限公司共同缔结，具有合同效力。本协议中杭州汀之兰文化有限公司在协议中称为"软铁"，协议签约的另一方称为原创会员或用户。
				    软铁网(系杭州汀之兰文化有限公司下属网站，以下简称"软铁网")是为原创会员与作品购买者搭建的原创数字视觉作品网络交易平台。交易双方各自利用软铁网交易平台完成交易，软铁网不参与网络交易。为获得软铁网提供基于互联网的相关服务，服务使用人(以下称"用户")必须同意本协议的全部条款并按照页面上的提示完成注册程序。如果用户在注册程序过程中在"阅读并同意"本协议处打勾（√）即表示用户完全接受本协议项下的全部条款。本协议内容包括协议正文及所有软铁网已经发布的各类 规则。所有规则为本协议不可分割的一部分，与本协议正文具有同等法律效力。
				    若您已经注册为本网站会员，即表示您已充分阅读、理解并同意自己与本网站订立本协议，且您自愿受本协议的条款约束。本网站有权随时修改本协议及软铁网规则，并在本网站上予以公告。本协议或各类规则如有任何修改，软铁网将在本网站上刊载公告，通知用户。经修订的条款一经在软铁网公布后，立即自动生效。如您不同意相关修改，必须停止使用本网站服务（以下简称"服务"）。如您登录或继续使用"服务"，视为您接受经修订的协议和规则。除另行明确声明外，任何使"服务"范围扩大或功能增强 的新内容均受本协议约束。 
				    请您务必在注册之前认真阅读全部服务协议内容，如有任何疑问，可向软铁咨询。
				    1)无论您事实上是否在注册之前认真阅读了本服务协议，只要您在"阅读并同意"本协议处打勾（√）或在软铁网明确声明“注册即代表您阅读同意”本协议的情况下点击进入注册软铁账号的下一步骤，并按照注册程序成功注册为用户，您的行为仍然表示其同意并签署了本服务协议。 
				    2)本协议不涉及您与其它软铁用户之间因网上交易而产生的法律关系及法律纠纷。
				    
				1. 用户注册
				1.1  用户注册是指用户登陆软铁网或其客户端，并按要求填写相关信息并确认同意履行相关用户协议的过程。
				1.2  符合下列条件之一的自然人、法人或其他组织才能申请成为本网站会员，可以使用本网站的服务。
				    1.2.1 根据中国法律年满18周岁或16周岁以上不满18周岁但以自己的劳动收入为主要生活来源的，具备完全民事行为能力的自然人或根据本国法律具有完全民事行为能力的外国自然人。
				    1.2.2 无民事行为能力人、限制民事行为能力人应经过其监护人同意。
				    1.2.3 根据中国或外国法律、法规、行政规章成立并合法存在的机关、企事业单位、社团组织和其他组织。未经批准设立的组织不能注册为软铁网用户。
				1.3 不当注册为软铁用户或超过其民事权利或行为能力范围从事交易的，其与软铁之间的服务协议自始无效，一经发现，软铁有权立即注销该用户，并追究其使用软铁网"服务"的一切法律责任。
				1.4 用户完成注册申请手续后，获得软铁网帐号。用户应提供明确的联系地址和联系电话，并提供真实姓名或名称，并不断更新注册资料。所有原始键入的资料将引用为注册资料。对于因注册信息不真实而引起的问题，以及该问题发生所带来的后果，软铁网不负任何责任。用户应当对以其用户帐号进行的所有活动和事件负法律责任。
				
				2. 用户的权利义务
				2.1  用户有权根据本协议及本网站发布的相关规则，利用本网站发布信息、查询会员信息，在本网站社区及相关模块发布信息，参加本网站的有关活动及有权享受本网站提供的其他有关资讯及信息服务。
				2.2  用户须自行负责自己的会员账号和密码，且须对在会员账号密码下发生的所有活动（包括但不限于发布信息、视觉/视听作品，网上点击同意各类协议、规则等）承担责任。用户有权根据需要更改登录和账户提现密码。 
				2.3  用户应当向本网站提供真实准确的注册信息，包括但不限于真实姓名、身份证号、联系电话、地址、电子邮箱、QQ或MSN、邮政编码等，保证本网站可以通过上述联系方式与自己进行联系。同时，用户也应当保证不以他人资料或虚假资料在软铁网进行注册或身份认证，并在相关资料实际变更时及时更新有关注册资料，如因用户提供他人资料、虚假资料、过期资料、非法资料等资料或未及时更新资料而造成软铁网损失的，用户应对此负责并承担全额赔偿责任。 
				    2.3.1   用户应妥善保管自己的软铁网帐号与密码，不得将其账号、密码透露、泄露、对外公布或通过转让、出租、出借、赠与、抵押、质押、留置等方式提供给他人使用，如用户发现其帐号遭他人非法使用，应立即通知软铁网。因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用而造成的账户及图片损失，由用户或非法使用者承担责任，软铁网不承担任何责任。
				    2.3.2 用户注册会员名时请勿使用敏感词汇（包括但不限于：不雅词汇、涉及政治、法律等），以及含有软铁、shitutu、版主、管理员、网站等词汇，软铁网有权删除此类账户，无需事先通知用户。
				2.4  软铁网账号的所有权归软铁所有，用户不得以任何形式擅自转让或授权他人使用自己在本网站的会员帐号。
				2.5  用户有义务确保在本网站上发布的信息真实、准确，无误导性。
				2.6  用户在本网站网上发布平台，不得发布国家法律、法规、行政规章规定禁止的信息、侵犯他人知识产权或其他合法权益的信息、违背社会公共利益或公共道德的信息。
				2.7  用户在本网站交易中应当遵守诚实信用原则，不得以发布侵权信息、虚假信息等不正当竞争方式扰乱网上交易秩序，不得从事与网上交易无关的不当行为，不得在交易平台上发布任何违法信息。
				2.8  用户不应采取不正当手段（包括但不限于虚假交易、互换好评等方式）提高自身或他人信用度，或采用不正当手段恶意评价其他用户，降低其他用户信用度。
				2.9  用户承诺使用软铁网，须遵守中华人民共和国相关法律法规，包括但不限于《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《中华人民共和国著作权法》及《信息网络传播权保护条例》等有关计算机互联网和知识产权的相关法律法规及规章规定等。如有违反导致任何法律后果的发生，用户将以自己的名义独立承担相应的法律责任。
				2.10 用户在本网站网上交易过程中如与其他用户因交易产生纠纷，可以请求本网站从中予以协调处理。用户如发现其他用户有违法或违反本协议的行为，可以向本网站举报。
				2.11 用户应当自行承担因交易产生或取得的相关费用，并依法纳税。在完成交易后，用户应向交易对方依法开具发票。
				2.12 未经本网站书面允许，用户不得使用本网站的任何资料以及在交易平台上所展示的任何信息（包括但不限于以复制、修改、翻译等形式制作衍生作品、分发或公开展示）。
				2.13  用户不得使用以下方式登录网站或破坏网站所提供的服务：
				     2.13.1 以任何机器人软件、蜘蛛软件、爬虫软件、刷屏软件或其它自动方式访问或登录本网站；
				     2.13.2 通过任何方式对本网站内部结构造成或可能造成不合理或不合比例的重大负荷的行为；
				     2.13.3 通过任何方式干扰或试图干扰网站的正常工作或网站上进行的任何活动；
				2.14  用户有权在同意本网站相关规则的前提下享受交易保障、交易救济等服务。
				2.15  用户同意接收来自本网站的信息，包括但不限于网站管理信息、更新信息、活动信息、交易信息、促销信息等。
				2.16  用户不得为任何非法目的而使用网络服务系统，遵守所有与网络服务有关的网络协议、规定和程序。 
				2.17  用户不得利用软铁服务进行任何可能对互联网的正常运转造成不利影响的行为。 
				2.18  用户不得利用软铁服务传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料。
				2.19  用户不得利用软铁服务进行任何不利于软铁或损害软铁利益的行为。
				2.20  用户如发现任何非法使用会员帐号或帐号出现安全漏洞的情况，应立即通告软铁网。
				
				3.软铁网的权利义务
				3.1  软铁网为设计、摄影等数字视觉作品的创作者和消费者提供一个交易、交流的平台。软铁网网络服务的具体内容由软铁网根据实际情况提供，例如作品搜索、作品上传、摄影栏目、设计栏目、悬赏栏目、专题推荐、精品推荐、排行版、汇客厅、信息中心等。
				3.2  软铁网将在现有技术水平的基础上保证网上交易平台的正常运行，避免网站服务中断等情形出现，保障用户的交易活动顺利进行。
				3.3  对用户使用软铁网上交易平台中所遇到与软铁网上注册或与交易有关的问题或情况，应及时回复。 
				3.4  软铁网设置的各种积分制度是为了调动网站用户的参与积极性，软铁网有权随时修改积分制度，调整用户的相关积分属性，未经软铁网许可，会员禁止以任何形式出售积分。
				3.5  软铁网有权在软铁网网站的任意位置、任意时间投放各种广告，但广告内容不影响网站注册用户正常使用网站各项功能。
				3.6  用户在软铁网上交易过程中如与其它用户因交易产生纠纷，请求软铁从中予以调处，经软铁审核后，软铁有权通过软铁网站内短信、会员QQ或MSN、电子邮件、联系电话等联系方式向纠纷双方了解情况，并将所了解的情况互相通知对方；用户通过司法或行政等手段解决纠纷的，软铁将依照法定程序提供相关资料。 
				3.7  对于用户在软铁网上交易平台上的不当行为或其它任何软铁认为应当终止服务的情况，软铁有权随时作出删除相关信息、终止服务提供等处理，而无须征得用户的同意。
				3.8  因网上交易平台的特殊性，软铁没有义务对所有用户的注册数据、所有的交易行为以及与交易有关的其它事项进行事先审查。但如存在下列情况，软铁网有权无需征得会员的同意，可根据不同情况选择保留或删除相关信息、限制用户的活动、向用户核实有关资料、发出警告通知、暂时中止、无限期中止及拒绝向该用户提供服务：
				    3.8.1 违反本服务协议及纳入本协议的其他规则的相关规定的；
				    3.8.2用户或其它第三方通知软铁，认为某个具体用户或具体交易事项可能存在重大问题；
				    3.8.3 用户或其它第三方向软铁告知交易平台上有违法或不当行为的，并提供相关证据，而软铁网无法联系到该用户进行核实，或者软铁以普通非专业交易者的知识水平标准对相关内容进行判别，可以明显认为这些内容或行为具有违法或不当性质的。
				3.9  经国家生效法律文书或行政处罚决定确认用户存在违法行为，或者软铁有足够事实依据可以认定用户存在违法或违反服务协议行为以及在本网站交易平台上的其他不当行为，软铁有权在软铁交易平台及所在网站上以网络发布形式公布用户的违法违规行为； 并有权随时作出删除相关信息、终止服务提供等处理。
				3.10  对于用户在软铁交易平台发布的下列各类信息，软铁有权在不通知用户的前提下进行删除或采取其它限制性措施，包括但不限于：以规避费用为目的的信息；以炒作信用为目的的信息；软铁有理由相信存在欺诈等恶意或虚假内容的信息；软铁有理由相信与网上交易无关或不是以交易为目的的信息；软铁有理由相信存在恶意竞价或其它试图扰乱正常交易秩序因素的信息；软铁有理由相信该信息违反公共利益或可能严重损害软铁或其它用户合法利益的；软铁有理由相信侵犯他人知识产权的信息等。
				3.11  软铁网依据本协议及相关规则，可以冻结、使用、先行赔付、退款、处置会员缴存在本网站账户内的资金。
				3.12  当第三方认为用户上传或者发表于软铁的信息侵犯其权利，并根据相关法律规定向软铁发送停止侵权通知时，用户同意软铁可以根据第三人提供或者软铁掌握的证据自行判断、决定是否删除涉嫌侵权的的信息。删除涉嫌侵权的信息之后，除非收到用户符合相关法律规定的书面说明，软铁将不会自动恢复上述删除的信息。
				3.13 软铁网有权建立交易保障服务制度和交易救济制度，设立交易保障金与保障基金以保障用户的合法权益。
				
				4. 服务的变更、中断或终止
				4.1 鉴于网络服务的特殊性，用户同意软铁网可自行全权决定，在发出通知或不发出通知的情况下，随时变更、中断或终止部分或全部的网络服务。服务终止后，软铁没有义务为用户保留原账户或与之相关的任何信息，或转发任何已阅读或发送，未曾阅读或发送的信息给用户或第三方。此外，用户同意，软铁不就终止用户接入"服务"而对用户或任何第三者承担任何责任。 
				    4.1.1 如变更、中断或终止的网络服务属于免费网络服务，软铁网无需通知用户，也无需对任何用户或任何第三方承担任何责任，当软铁网变更、中断或终止全部的网络服务时，软铁网无须为会员在软铁网获得的各种积分提供赔偿、退款服务。
				    4.1.2 如变更、中断或终止的网络服务涉及收费网络服务，软铁网应当按照该用户实际使用相应收费网络服务的情况扣除相应服务费之后将剩余的服务费退还给该用户。
				4.2  软铁网需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，如因此类情况而造成收费网络服务在合理时间内的中断，软铁网无需为此承担任何责任，但软铁网应尽可能事先进行通告。
				4.3  用户同意软铁网基于其自行之考虑，因任何理由，包含但不限于长时间未使用，或软铁网认为用户已经违反本服务协议的文字及精神，无需进行事先通知即可中断或终止，终止您的密码、帐号或本服务之使用（或服务之任何部分）。用户承认并同意，软铁网可立即关闭或删除用户的帐号及帐号中所有相关信息及文件，及/或禁止继续使用前述文件或本服务。此外，用户同意若本服务之使用被中断或终止或用户的帐号及相关信息和文件被关闭或删除，软铁网对用户或任何第三人均不承担任何责任。
				4.4 如用户注册的免费网络服务的帐号在任何连续180日内未实际使用，则软铁网有权删除该帐号并停止为该用户提供相关的网络服务。
				4.5  若用户向本网站提出注销软铁网注册会员身份，需经软铁网审核同意，注销该注册会员，会员即解除与软铁网的协议关系，但软铁网仍保留下列权利：
				    4.5.1 软铁网有权在法律、法规、行政规章规定的时间内保留该会员的资料,包括但不限于会员资料、交易记录等。
				    4.5.2 若会员注销前在软铁网交易平台上存在违法行为或违反本协议的行为，软铁网仍可行使本协议及相关规则所规定的权利，追究该会员的法律责任。
				
				    若用户提出注销其软铁网注册会员身份前，与其它软铁网用户或软铁网尚有未完结的诉讼、仲裁、损失赔偿、欠费等纠纷，软铁网有权拒绝其注销请求，直到前述纠纷完结。用户提出注销后仍对其账户及账户关联的全部内容负责。
				
				4.6 用户存在下列情况，软铁网可以通过注销用户账号的方式终止服务：
				    4.6.1 在用户违反本协议及相关规则规定时，软铁网有权终止向用户提供服务。软铁网将在终止服务时通知会员。但该用户在被软铁网终止提供服务后，再一次直接或间接或以他人名义注册为软铁网用户的，软铁网有权再次单方面终止为该用户提供服务；
				    4.6.2 软铁发现用户注册资料中主要内容是虚假的，软铁有权随时终止为该用户提供服务；
				    4.6.3 本协议终止或修改后，用户未确认新的协议的；
				    4.6.4 其它软铁认为需终止服务的情况。
				
				5. 隐私保护
				5.1  信息使用
				    5.1.1 保护用户隐私是软铁网的一项基本原则，软铁网不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在软铁网的非公开内容。.
				    5.1.2 软铁网不允许任何第三方以任何手段收集、编辑、出售或者无偿传播会员的信息。任何用户有本条所禁止的行为，一经发现，软铁网有权立即终止与该用户的服务协议，查封其账号。
				    5.1.3 在不透露单个用户隐私资料的前提下，软铁网有权对整个用户数据库进行分析并对用户数据库进行商业上与非商业上的利用。
				    5.1.4 为服务用户的目的，软铁网有权通过使用用户的个人信息，向用户提供服务，包括但不限于向用户发出产品和服务信息，或者与软铁网合作伙伴共享信息以便其向用户发送有关其产品和服务的信息。
				    5.1.5 为验证用户信息的真实性，软铁网有权通过第三方核查用户的隐私材料，无需另外向用户支付信息使用费。因用户自身原因导致多次重复验证的，软铁网有权依照网站规定向用户收取信息验证费。
				5.2  信息披露：用户的信息将在下述情况下部分或全部被披露
				    5.2.1 事先获得用户的明确授权；
				    5.2.2 若用户是合法的知识产权权利人并提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；
				    5.2.3 用户出现违反中国法律法规、规章、制度或者软铁网规定的情况，需要向第三方披露；
				    5.2.4 根据法律的有关规定，或者行政、司法机关的要求，向第三方或者行政、司法机关披露；
				    5.2.5 为提供用户所要求的产品和服务，而必须和第三方分享用户的个人信息；
				    5.2.6 软铁网可能会与第三方合作向用户提供相关的网络服务，在该第三方同意承担与软铁网同等的用户隐私权保护责任的情况下，用户同意软铁网向该第三方披露其注册信息及在软铁网的其他资料等。
				    5.2.7 软铁网根据法律或者本网站规定认为合适的披露；
				5.3  信息安全
				    5.3.1 在使用本网站服务进行网上交易时，请用户妥善保护自己的信息，仅在必要的情形下向他人提供；
				    5.3.2 如果用户发现自己的信息泄密，尤其是注册账户或支付账户及密码发生泄露，请用户立即联络软铁网客服，以便我们采取相应措施。
				5.4  Cookie的使用
				         5.4.1 在用户未拒绝接受cookies的情况下，软铁会在用户的计算机上设定或取用cookies，以便用户能登录或使用依赖于cookies的软铁网络服务或功能。软铁使用cookies可为用户提供更加周到的个性化服务，包括推广服务。
				         5.4.2 用户有权选择接受或拒绝接受cookies。用户可以通过修改浏览器设置的方式拒绝接受cookies。但如果用户选择拒绝接受cookies，则用户可能无法登录或使用依赖于cookies的软铁网络服务或功能。
				         5.4.3 通过软铁所设cookies所取得的有关信息，将适用本协议第5条隐私保护条款。
				
				6. 免责声明
				6.1  软铁网只是为用户提供一个服务交易的平台，对于用户所发布的信息的合法性、真实性及其品质，以及用户履行交易的能力等，本网站一律不负任何担保责任。本网站也不对用户所提供的作品及其资料、已通过身份认证的用户及其所提供的身份信息、网站制度作任何合法性、真实性的保证。用户明确同意其使用软铁网网络服务所存在的风险将完全由其自己承担；因其使用软铁网网络服务而产生的一切后果也由其自己承担，软铁网对用户不承担任何责任。
				
				6.2  软铁网不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。
				6.3  软铁网不保证为向用户提供便利而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由软铁网实际控制的任何网页上的内容，软铁网不承担任何责任。
				6.4  对于因不可抗力或软铁网不能控制的原因造成的网络服务中断或其它缺陷，软铁网不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。
				6.5  用户同意，对于软铁网向用户提供的下列产品或者服务的质量缺陷本身及其引发的任何损失，软铁网无需承担任何责任：
				    6.5.1 软铁网向用户免费提供的各项网络服务；
				   6.5.2 软铁网向用户赠送的任何产品或者服务；
				    6.5.3 软铁网向收费网络服务用户附赠的各种产品或者服务。
				
				7. 知识产权
				7.1  软铁网及软铁网所使用的任何相关软件、程序、内容，包括但不限于作品、图片、档案、资料、网站构架、网站版面的安排、网页设计、经由软铁网或广告商向用户呈现的广告或资讯，均由软铁网或其它权利人依法享有相应的知识产权及物权，包括但不限于著作权、商标权、专利权或其它专属权利等，受到相关法律的保护。未经软铁网或权利人明示授权，用户不得以修改、出租、出借、出售、散布等方式使用软铁网及软铁网所使用的上述任何资料和资源，或根据上述资料和资源制作成任何种类产品。
				7.2  软铁网授予用户对本网站或本网站提供的软件不可转让及非专属的使用权，使用户可以通过单机计算机使用本网站的目标代码（以下简称"软件"），但用户不得且不得允许任何第三方复制、修改、创作衍生作品、进行反向工程、反向组译，或以其它方式破译或试图破译源代码，或出售、转让"软件"或对"软件 "进行再授权，或以其它方式移转"软件"之任何权利。用户同意不以任何方式修改"软件"，或使用修改后的"软件"。
				7.3 用户不得经由非本网站所提供的界面使用本网站，不得在除本网站以外的网站上对本网站建立镜像。
				
				8. 通知送达
				8.1  本协议项下，软铁网对于用户所有的通知均可通过网页公告、软铁网站内短信、电子邮件、手机短信或常规的信件传送等方式中的任何一种进行，且均于发送成功之时视为已送达收件人。
				
				9.不可抗力
				因不可抗力或者其他意外事件，使得本协议的履行不可能、不必要或者无意义的，双方均不承担责任。本协议所称之不可抗力是指双方不能合理控制、不可预见或及时预见亦无法避免的事件（包括但不限于政府行为、自然灾害、黑客攻击、病毒感染、第三方服务故障、网络平台及平台软件服务器崩溃、电信部门技术管制、战争或任何其他类似事件），该事件妨碍、影响或延误一方根据本协议履行其全部或部分义务。
				
				10. 保密
				用户对讨论、签订、执行本协议中所获悉的属于对方的、且无法自公开渠道获得的文件及资料（包括但不限于商业秘密、公司计划、运营活动、财务信息、技术信息、经营信息及其他商业秘密）予以保密。未经该资料和文件的原提供方同意，另一方不得向第三方泄露该商业秘密的全部或者部分内容。但法律、法规、行政规章另有规定或者双方另有约定的除外。
				
				11.争议解决
				11.1  本协议及其规则的有效性、履行及争议解决等所有事宜，均适用中华人民共和国法律法规及相关规定。
				11.2  就本协议及协议所附规则的内容或其执行发生任何争议，应尽量友好协商解决；协商不成时，均应向软铁住所地人民法院提起诉讼。
				11.3  软铁网有权受理并调处您与其他用户因交易服务产生的争议，同时有权单方面以非专业交易者的知识水平标准独立判断其他会员对您的投诉及索偿是否成立。若本网站判断索偿成立，则本网站有权使用您已被托管的任务赏金、交纳的交易保障金、账户内未提现的金额进行相应偿付。本网站没有使用自用资金进行偿付的义务，但若进行了该等支付，您应及时赔偿本网站的全部损失，否则本网站有权通过前述方式抵减相应资金或权益，如仍无法弥补损失，则本网站保留继续追偿的权利。因本网站非司法机关，您完全理解并承认，本网站对证据的鉴别能力及对纠纷的处理能力有限，受理交易争议完全是基于您之委托，不保证争议处理结果符合您的期望，本网站有权决定是否参与争议的调处。
				
				12 附则
				12.1  在本协议中所使用的下列词语，除非另有定义，应具有以下含义：
				   12.1.1 "本网站"在无特别说明的情况下，均指"软铁网"。 “客户端”在无特别说明的情况下，均指“手机软铁”APP或“软铁手机端应用”。
				     12.1.2"用户"： 指具有完全民事行为能力的软铁网各项服务的使用者。
				     12.1.3 "会员"： 指与软铁网签订《软铁网服务协议》并购买会员功能后完成注册流程的用户。
				
				 


			</view>
		
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				swiperHeight:500,
				pic_url:'https://admin.shitutu.com/public/douyinimg/mycarda.png',
				liuhaiHeight:3
			}
		},
		onShow:function(){
		    //获取全局设置的变量
		    this.memberData = this.$member.memberObj;
			this.liuhaiHeight = this.memberData.statusBarHeight + 10
		},
		onLoad() {
			uni.getSystemInfo({
			    success:  (res) => {    
			        this.swiperHeight = res.windowHeight 
			    }
			});
		},
		methods:{
			onReturn(){
				uni.navigateBack({
				    delta: 1
				});
			},
		},
		created() {
			
		}
	
	}
</script>

<style>
</style>
